
# Даны два неупорядоченных набора целых чисел (может быть, с повторениями).
#  Выдать без повторений в порядке возрастания все те числа, которые встречаются в обоих
# наборах.
# Пользователь вводит 2 числа. n - кол-во элементов первого множества. 
# m - кол-во элементов второго множества. Затем пользователь вводит сами элементы
#  множеств.

import random
n = int(input('введите количество чисел в наборе N: '))
m = int(input('введите количество чисел в наборе M: '))
Nab_N =list()
Nab_M =list()


for i in range (n):
    Nab_N.append(random.randint(-10,10))

for i in range (m):
    Nab_M.append(random.randint(-10,10))

print(f'Набор N:')
print(Nab_N)
print(f'Набор M:')
print(Nab_M)

Nab_N=set(Nab_N)
Nab_M=set(Nab_M)
Union_Nab=Nab_N.union(Nab_M)    # При объединении множеств устраняется повторяемость элементов
#print(Union_Nab)
rez_Nab=sorted(Union_Nab)   # Встроенная сортировка по возрастанию (по умолчанию)
print('Результирующий набор:')
print(rez_Nab)
