
# В фермерском хозяйстве в Карелии выращивают чернику. 
# Она растет на круглой грядке, причем кусты высажены только по окружности. 
# Таким образом, у каждого куста есть ровно два соседних. Всего на грядке растет N кустов.

# Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них выросло различное
# число ягод – на i-ом кусте выросло ai ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники. 
# Эта система состоит из управляющего модуля и нескольких собирающих модулей. 
# Собирающий модуль за один заход, находясь непосредственно перед некоторым кустом, 
# собирает ягоды с этого куста и с двух соседних с ним.

# Напишите программу для нахождения максимального числа ягод, которое может собрать за 
# один заход собирающий модуль, находясь перед некоторым кустом заданной во входном 
# файле грядки.

import random
kyst = int(input('введите количество кустов на грядке: '))
yagod = list()

for i in range (kyst):
    yagod.append(random.randint(20,100))
print('Количество ягод на кустах:')
print(yagod)

yrogai_segm = list()
for i in range(len(yagod)-1):
    yrogai_segm.append(yagod[i-1]+yagod[i]+yagod[i+1])
yrogai_segm.append(yagod[-2]+yagod[-1]+yagod[0])
# print(yrogai_segm)    
print(f'Максиамальный урожай сегмента: {max(yrogai_segm)} ягод')
print(f'Начинать сбор надо с куста № {yrogai_segm.index(max(yrogai_segm))+1}')